; ModuleID = 'xdp_prog_kern.c'
source_filename = "xdp_prog_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpf"

%struct.bpf_map_def = type { i32, i32, i32, i32, i32, i32, i32 }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%union.anon = type { [2 x i32] }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, i32, i32 }
%struct.lpm_val = type { i8 }

@counter = global %struct.bpf_map_def { i32 2, i32 4, i32 4, i32 10, i32 0, i32 0, i32 0 }, section "maps", align 4, !dbg !0
@tx_port = global %struct.bpf_map_def { i32 14, i32 4, i32 4, i32 10, i32 0, i32 0, i32 0 }, section "maps", align 4, !dbg !22
@sw_nics = global %struct.bpf_map_def { i32 2, i32 4, i32 6, i32 10, i32 0, i32 0, i32 0 }, section "maps", align 4, !dbg !35
@routes = global %struct.bpf_map_def { i32 11, i32 8, i32 1, i32 512, i32 1, i32 0, i32 0 }, section "maps", align 4, !dbg !37
@xdp_pass_func.____fmt = private unnamed_addr constant [22 x i8] c"TRIE hit!, output=%d\0A\00", align 1
@xdp_pass_func.____fmt.1 = private unnamed_addr constant [20 x i8] c"Iface MAC Addr: %s\0A\00", align 1
@xdp_pass_func.____fmt.2 = private unnamed_addr constant [17 x i8] c"TRIE miss for..\0A\00", align 1
@_license = global [4 x i8] c"GPL\00", section "license", align 1, !dbg !39

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "counter", scope: !2, file: !3, line: 23, type: !24, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !21)
!3 = !DIFile(filename: "xdp_prog_kern.c", directory: "/home/anuraag/IITB/Sem6/router-src/_switch/scripts/bpfcode")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 2845, size: 32, elements: !7)
!6 = !DIFile(filename: "../includes/headers/linux/bpf.h", directory: "/home/anuraag/IITB/Sem6/router-src/_switch/scripts/bpfcode")
!7 = !{!8, !9, !10, !11, !12}
!8 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!9 = !DIEnumerator(name: "XDP_DROP", value: 1)
!10 = !DIEnumerator(name: "XDP_PASS", value: 2)
!11 = !DIEnumerator(name: "XDP_TX", value: 3)
!12 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!13 = !{!14, !15, !16, !18}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!15 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !17, line: 25, baseType: !18)
!17 = !DIFile(filename: "/usr/include/linux/types.h", directory: "/home/anuraag/IITB/Sem6/router-src/_switch/scripts/bpfcode")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !19, line: 24, baseType: !20)
!19 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/anuraag/IITB/Sem6/router-src/_switch/scripts/bpfcode")
!20 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!21 = !{!0, !22, !35, !37, !39, !45, !50}
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "tx_port", scope: !2, file: !3, line: 31, type: !24, isLocal: false, isDefinition: true)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !25, line: 210, size: 224, elements: !26)
!25 = !DIFile(filename: "../includes/headers/bpf_helpers.h", directory: "/home/anuraag/IITB/Sem6/router-src/_switch/scripts/bpfcode")
!26 = !{!27, !29, !30, !31, !32, !33, !34}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !24, file: !25, line: 211, baseType: !28, size: 32)
!28 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !24, file: !25, line: 212, baseType: !28, size: 32, offset: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !24, file: !25, line: 213, baseType: !28, size: 32, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !24, file: !25, line: 214, baseType: !28, size: 32, offset: 96)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !24, file: !25, line: 215, baseType: !28, size: 32, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "inner_map_idx", scope: !24, file: !25, line: 216, baseType: !28, size: 32, offset: 160)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "numa_node", scope: !24, file: !25, line: 217, baseType: !28, size: 32, offset: 192)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "sw_nics", scope: !2, file: !3, line: 38, type: !24, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "routes", scope: !2, file: !3, line: 50, type: !24, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 168, type: !41, isLocal: false, isDefinition: true)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 32, elements: !43)
!42 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!43 = !{!44}
!44 = !DISubrange(count: 4)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !25, line: 20, type: !47, isLocal: true, isDefinition: true)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!14, !14, !14}
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !25, line: 38, type: !52, isLocal: true, isDefinition: true)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!55, !56, !55, null}
!55 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!58 = !{i32 2, !"Dwarf Version", i32 4}
!59 = !{i32 2, !"Debug Info Version", i32 3}
!60 = !{i32 1, !"wchar_size", i32 4}
!61 = !{!"clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)"}
!62 = distinct !DISubprogram(name: "xdp_pass_func", scope: !3, file: !3, line: 60, type: !63, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !74)
!63 = !DISubroutineType(types: !64)
!64 = !{!55, !65}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 2856, size: 160, elements: !67)
!67 = !{!68, !70, !71, !72, !73}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !66, file: !6, line: 2857, baseType: !69, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !19, line: 27, baseType: !28)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !66, file: !6, line: 2858, baseType: !69, size: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !66, file: !6, line: 2859, baseType: !69, size: 32, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !66, file: !6, line: 2861, baseType: !69, size: 32, offset: 96)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !66, file: !6, line: 2862, baseType: !69, size: 32, offset: 128)
!74 = !{!75, !76, !77, !78, !90, !91, !93, !112, !113, !124, !129, !136, !137, !139, !145, !146, !148, !153, !159, !161, !163, !165}
!75 = !DILocalVariable(name: "ctx", arg: 1, scope: !62, file: !3, line: 60, type: !65)
!76 = !DILocalVariable(name: "data", scope: !62, file: !3, line: 62, type: !14)
!77 = !DILocalVariable(name: "data_end", scope: !62, file: !3, line: 63, type: !14)
!78 = !DILocalVariable(name: "eth", scope: !62, file: !3, line: 64, type: !79)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !81, line: 159, size: 112, elements: !82)
!81 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "/home/anuraag/IITB/Sem6/router-src/_switch/scripts/bpfcode")
!82 = !{!83, !88, !89}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !80, file: !81, line: 160, baseType: !84, size: 48)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 48, elements: !86)
!85 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!86 = !{!87}
!87 = !DISubrange(count: 6)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !80, file: !81, line: 161, baseType: !84, size: 48, offset: 48)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !80, file: !81, line: 162, baseType: !16, size: 16, offset: 96)
!90 = !DILocalVariable(name: "int_key", scope: !62, file: !3, line: 71, type: !55)
!91 = !DILocalVariable(name: "int_val", scope: !62, file: !3, line: 72, type: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!93 = !DILocalVariable(name: "ip", scope: !62, file: !3, line: 82, type: !94)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !96, line: 86, size: 160, elements: !97)
!96 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "/home/anuraag/IITB/Sem6/router-src/_switch/scripts/bpfcode")
!97 = !{!98, !100, !101, !102, !103, !104, !105, !106, !107, !109, !111}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !95, file: !96, line: 88, baseType: !99, size: 4, flags: DIFlagBitField, extraData: i64 0)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !19, line: 21, baseType: !85)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !95, file: !96, line: 89, baseType: !99, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !95, file: !96, line: 96, baseType: !99, size: 8, offset: 8)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !95, file: !96, line: 97, baseType: !16, size: 16, offset: 16)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !95, file: !96, line: 98, baseType: !16, size: 16, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !95, file: !96, line: 99, baseType: !16, size: 16, offset: 48)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !95, file: !96, line: 100, baseType: !99, size: 8, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !95, file: !96, line: 101, baseType: !99, size: 8, offset: 72)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !95, file: !96, line: 102, baseType: !108, size: 16, offset: 80)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !17, line: 31, baseType: !18)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !95, file: !96, line: 103, baseType: !110, size: 32, offset: 96)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !17, line: 27, baseType: !69)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !95, file: !96, line: 104, baseType: !110, size: 32, offset: 128)
!112 = !DILocalVariable(name: "dst_ip", scope: !62, file: !3, line: 87, type: !69)
!113 = !DILocalVariable(name: "key4", scope: !62, file: !3, line: 92, type: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !62, file: !3, line: 89, size: 64, elements: !115)
!115 = !{!116, !120}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "b32", scope: !114, file: !3, line: 90, baseType: !117, size: 64)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 64, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 2)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "b8", scope: !114, file: !3, line: 91, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 64, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 8)
!124 = !DILocalVariable(name: "val", scope: !62, file: !3, line: 93, type: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpm_val", file: !3, line: 45, size: 8, elements: !127)
!127 = !{!128}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !126, file: !3, line: 46, baseType: !99, size: 8)
!129 = !DILocalVariable(name: "____fmt", scope: !130, file: !3, line: 104, type: !133)
!130 = distinct !DILexicalBlock(scope: !131, file: !3, line: 104, column: 3)
!131 = distinct !DILexicalBlock(scope: !132, file: !3, line: 103, column: 12)
!132 = distinct !DILexicalBlock(scope: !62, file: !3, line: 103, column: 8)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 176, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 22)
!136 = !DILocalVariable(name: "ifaceno", scope: !131, file: !3, line: 105, type: !55)
!137 = !DILocalVariable(name: "srcmac_addr", scope: !131, file: !3, line: 106, type: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!139 = !DILocalVariable(name: "buffer", scope: !140, file: !3, line: 109, type: !142)
!140 = distinct !DILexicalBlock(scope: !141, file: !3, line: 108, column: 18)
!141 = distinct !DILexicalBlock(scope: !131, file: !3, line: 108, column: 6)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 240, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 30)
!145 = !DILocalVariable(name: "run", scope: !140, file: !3, line: 110, type: !55)
!146 = !DILocalVariable(name: "p", scope: !147, file: !3, line: 117, type: !55)
!147 = distinct !DILexicalBlock(scope: !140, file: !3, line: 117, column: 4)
!148 = !DILocalVariable(name: "____fmt", scope: !149, file: !3, line: 136, type: !150)
!149 = distinct !DILexicalBlock(scope: !140, file: !3, line: 136, column: 4)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 160, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 20)
!153 = !DILocalVariable(name: "____fmt", scope: !154, file: !3, line: 139, type: !156)
!154 = distinct !DILexicalBlock(scope: !155, file: !3, line: 139, column: 3)
!155 = distinct !DILexicalBlock(scope: !132, file: !3, line: 138, column: 7)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 136, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 17)
!159 = !DILocalVariable(name: "____fmt", scope: !160, file: !3, line: 140, type: !41)
!160 = distinct !DILexicalBlock(scope: !155, file: !3, line: 140, column: 3)
!161 = !DILocalVariable(name: "____fmt", scope: !162, file: !3, line: 141, type: !41)
!162 = distinct !DILexicalBlock(scope: !155, file: !3, line: 141, column: 6)
!163 = !DILocalVariable(name: "____fmt", scope: !164, file: !3, line: 142, type: !41)
!164 = distinct !DILexicalBlock(scope: !155, file: !3, line: 142, column: 6)
!165 = !DILocalVariable(name: "____fmt", scope: !166, file: !3, line: 143, type: !41)
!166 = distinct !DILexicalBlock(scope: !155, file: !3, line: 143, column: 6)
